# RevitLinkOptions Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RevitLinkOptions Members
RevitLinkOptions Class Constructors Methods Properties See Also
---
The RevitLinkOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RevitLinkOptions(Boolean) | Creates a RevitLinkOptions object, specifying relative or absolute path type. If the link is workshared, all worksets will be opened. |
| RevitLinkOptions(RevitLinkOptions) | Constructs a new copy of the input RevitLinkOptions object. |
| RevitLinkOptions(Boolean, WorksetConfiguration) | Creates a RevitLinkOptions object, specifying relative or absolute path type, and the desired workset configuration. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the RevitLinkOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetWorksetConfiguration | Gets the set of worksets to open when creating the link. |
| SetWorksetConfiguration | Sets the set of worksets to open when creating the link. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsRelative | The type of path to use when creating the link. If true, Revit will store a relative path for the link. If false, Revit will store an absolute path. If the link is to a Revit Server location, isRelative must be false. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
RevitLinkOptions Class
Autodesk.Revit.DB Namespace